Конечно, вот лабораторная работа, разделенная на два файла в формате Markdown.

### **Файл 1: Лабораторная работа №2**

---

# Лабораторная работа №2
## «Массивы и строки»

**Цель:** целью данной работы является получение опыта работы с массивами и строками на языке высокого уровня C#, в среде программирования Microsoft Visual Studio.

---

### **Задание:**

**1. На вход программы подаётся массив целых чисел произвольной длины (из консоли или заполняется циклом). Далее происходит инвертирование массива, после чего в консоль выводятся исходный и инвертированный массивы.**

**Пример:**

*   **Вход:**
| 1 | 2 | 3 | 4 | 5 |
*   **Выход:**
| 5 | 4 | 3 | 2 | 1 |

Массив — это пронумерованная коллекция элементов одного типа. Массивы используются для хранения и обработки большого количества данных одного типа. Они имеют фиксированный размер и индексируются с нуля.

Инвертирование массива означает изменение порядка элементов массива так, чтобы первый элемент становился последним, второй элемент — вторым с конца и так далее.

*Для выполнения 1 задания вам понадобятся операторы:*
1.  `Console.ReadLine` – для считывания числа из консоли
2.  `Console.WriteLine` – для вывода на экран сообщений
3.  `int` – Объявление массива целых чисел
4.  `for` – цикл, в котором некоторая результирующая переменная будет изменяться (например, увеличиваться или уменьшаться) определенное количество раз.
5.  `Array.Reverse` - эта функция меняет порядок элементов в массиве на обратный

---

**2. На вход программы подаётся размерность двумерного массива MxN, где М обозначает количество строк, а N — количество столбцов в массиве (значения М и N заданы в коде). Далее двумерный массив заполняется числами от 1 до M*N “змейкой”, после чего заполненный массив выводится в консоль.**

**Пример:**

*   **Вход:** М = 3, N = 3;
*   **Выход:**
| 1 | 2 | 3 |
| :--- | :--- | :--- |
| 6 | 5 | 4 |
| 7 | 8 | 9 |

Двумерный массив — это массив, состоящий из одномерных массивов (строк), которые расположены последовательно в памяти. Он представляет собой матрицу, состоящую из строк и столбцов.

*Для выполнения 2 задания вам понадобятся операторы:*
1.  `Console.ReadLine` – для считывания числа из консоли
2.  `Console.WriteLine` – для вывода на экран сообщений
3.  `int` – Объявление массива целых чисел
4.  `for` – цикл, в котором некоторая результирующая переменная будет изменяться определенное количество раз.
5.  `if, else` – используются для управления направлением движения "змейки" по массиву.

---

**3. На вход программы подаётся размерность двумерного массива МхN и одномерный массив размерностью M*N (значения М и N заданы в коде, массив заполняется в коде или из консоли). Далее создаётся двумерный массив размерностью MxN и элементы одномерного массива построчно копируются в двумерный массив, после чего оба массива выводятся в консоль.**

**Пример:**

*   **Вход:** M = 3, N = 3; `[1, 2, 3, 4, 5, 6, 7, 8, 9]`
*   **Выход:**
| 1 | 2 | 3 |
| :--- | :--- | :--- |
| 4 | 5 | 6 |
| 7 | 8 | 9 |

*Для выполнения 3 задания вам понадобятся операторы:*
1.  `Console.ReadLine` – для считывания числа из консоли
2.  `Console.WriteLine` – для вывода на экран сообщений
3.  `int` – Объявление массива целых чисел
4.  `for` – цикл, в котором некоторая результирующая переменная будет изменяться определенное количество раз.

---

**4. На вход программы подаётся двумерный массив размерностью MxN (значения М и N заданы в коде). Далее осуществляется поиск максимального и минимального элементов в массиве, после чего массив, а также значения максимального и минимального элементов выводятся в консоль.**

**Пример:**

*   **Вход:** M = 3, N = 3;
| 1 | 2 | 3 |
| :--- | :--- | :--- |
| 4 | 5 | 6 |
| 7 | 8 | 9 |
*   **Выход:** MIN = 1, MAX = 9;

*Для выполнения 4 задания вам понадобятся операторы:*
1.  `Console.ReadLine` – для считывания числа из консоли
2.  `Console.WriteLine` – для вывода на экран сообщений
3.  `int` – Объявление массива целых чисел
4.  `for` – цикл, в котором некоторая результирующая переменная будет изменяться определенное количество раз.
5.  `Random` – в работе этого класса заложен алгоритм, который генерирует последовательность чисел.

---

**5. На вход программы подаётся строка символов (задана в коде или из консоли). Далее определяется количество разных символов в строке, после чего в консоль выводится заданная строка и количество разных символов в ней.**

**Пример:**

*   **Вход:** “Это тестовая строка.”
*   **Выход:** Symbols = 12;

*Для выполнения 5 задания вам понадобятся операторы:*
1.  `Console.ReadLine` – для считывания числа из консоли
2.  `Console.WriteLine` – для вывода на экран сообщений
3.  `foreach` - используется для итерации по символам в строке

---

**6. На вход программы подаётся строка символов (заполняется в коде или из консоли). Далее определяется количество повторений для каждого символа, после чего в консоль выводится заданная и уникальные символы этой строки с количеством их повторений в ней.**

**Пример:**

*   **Вход:** “мама мыла раму”
*   **Выход:** М = 4, А = 4, Ы = 1, Л = 1, Р = 1, У = 1;

*Для выполнения 6 задания вам понадобятся операторы:*
1.  `Console.ReadLine` – для считывания числа из консоли
2.  `Console.WriteLine` – для вывода на экран сообщений
3.  `int` – Объявление массива целых чисел (или `Dictionary` для удобства)
4.  `foreach` – используется для итерации по символам в строке
5.  `TryGetValue` – получает из словаря элемент по ключу key.

---

**7. На вход программы подаётся строка символов (заполняется в коде или из консоли). Далее пользователь вводит символ, и введённый пользователем символ удаляется из строки, после чего получившаяся строка выводится в консоль.**

**Пример:**

*   **Вход:** “исходная строка”, “а”
*   **Выход:** “исходня строк”

*Для выполнения 7 задания вам понадобятся операторы:*
1.  `Console.ReadLine` – для считывания числа из консоли
2.  `Console.WriteLine` – для вывода на экран сообщений
3.  `String.Replace` – эта функция заменяет все вхождения одного символа на другой (или на пустую строку для удаления).

